src/InformationRegisters/Диалоги/Диалоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Диалоги</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>UID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СоцСеть</name>
    <type>
      <types>EnumRef.СоцСети</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыКартинок/ВидыКартинок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКартинок</name>
  <enumValues>
    <name>Одиночная</name>
  </enumValues>
  <enumValues>
    <name>Галерея</name>
  </enumValues>
  <enumValues>
    <name>Термин</name>
  </enumValues>
  <enumValues>
    <name>Событие</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СоцСети/СоцСети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоцСети</name>
  <enumValues>
    <name>VK</name>
  </enumValues>
  <enumValues>
    <name>Telegram</name>
  </enumValues>
  <enumValues>
    <name>VKT</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Сообщества/Сообщества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сообщества</name>
  <predefined>
    <items>
      <name>Athenaeum</name>
      <description>Two- Digit Athenaeum</description>
    </items>
    <items>
      <name>Тест</name>
      <description>Тест</description>
    </items>
  </predefined>
  <attributes>
    <name>ВК_ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_V</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_owner_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_client_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_access_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_client_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_communitysecret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_communitytoken</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_chat_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаVK</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>TGB_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDАльбома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПостовВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_НомерКомпании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_Кабинет</name>
    <type>
      <types>CatalogRef.РекламныеКабинеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВК_ДневнойЛимитНаЗапись</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_НомерКатегории</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъявлений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйУровеньПоста</name>
    <type>
      <types>EnumRef.УровниПостов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСообществ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщества</name>
    <type>
      <types>EnumRef.ТипыСообществ</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскруткаБотами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лого</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСложноПосты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСложнопостов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьСтатистику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Объявления</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОбновления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <predefined>
    <items>
      <name>Ферапонт</name>
      <description>Ферапонт</description>
    </items>
    <items>
      <name>ЭтотПользователь</name>
      <description>Этот пользователь</description>
    </items>
  </predefined>
  <attributes>
    <name>Telegram</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VK</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Никнейм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешилПисатьVK</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеНастройки</name>
    <type>
      <types>CatalogRef.ПерсональныеНастройки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_БотОстановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ТГ_Действия/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СоздатьПост(Знач Пост = "", Знач СтруктураЗаписи = "", Знач Сообщество) Экспорт
	
	Параметры = Новый Структура;
	Файлы = Новый Массив;
	
	Токен	= Сообщество.ТГ_token;
	Чат     = Сообщество.ТГ_chat_id;
	
	Параметры.Вставить("token"	, Токен);
	Параметры.Вставить("chat_id", Чат);
	
	Если ЗначениеЗаполнено(Пост) Тогда
		
		ДД 	= Пост.КартинкаДвоичные.Получить();
		ИВФ = ПолучитьИмяВременногоФайла(".png");
		
		Если Пост.ВидКартинки = Перечисления.ВидыКартинок.Одиночная Или Не ЗначениеЗаполнено(Пост.ВидКартинки) Тогда
										
			Если Не ЗначениеЗаполнено(ДД) Тогда
				Файлы.Добавить(?(ТипЗнч(Пост) = Тип("Соответствие"), Пост[Строка("Картинка")], Пост.Картинка));
			Иначе
				ДД.Записать(ИВФ);
				Файлы.Добавить(?(ТипЗнч(Пост) = Тип("Соответствие"), Пост[Строка("Картинка")], ИВФ));
			КонецЕсли;
			
		ИначеЕсли Пост.ВидКартинки = Перечисления.ВидыКартинок.Галерея Тогда
			
			ДД.Записать(ИВФ);
			
			МассивКартинок = РаботаССистемойСервер.СформироватьГалерею(ИВФ);
			
			Для Каждого КартинкаГалереи Из МассивКартинок Цикл
				
				Файлы.Добавить(КартинкаГалереи);
				
			КонецЦикла;
			
			
		ИначеЕсли Пост.ВидКартинки = Перечисления.ВидыКартинок.Термин Тогда
			Файлы.Добавить(РаботаССистемойСервер.СформироватьТермин(Пост.Содержание));
		ИначеЕсли Пост.ВидКартинки = Перечисления.ВидыКартинок.Событие Тогда
			Файлы.Добавить(РаботаССистемойСервер.СформироватьСобытие(Пост.Содержание, Пост.Сообщество));
		КонецЕсли;
		Параметры.Вставить(
		"caption"
		, ?(ТипЗнч(Пост) = Тип("Соответствие"), Строка(ТекущаяДатаСеанса()), ФормированиеПостовСервер.СформироватьТекстПоста(Пост)));
		
	Иначе
		
		Файлы.Добавить(СтруктураЗаписи.Картинка);
		Параметры.Вставить("caption", СтруктураЗаписи.Текст);
		
		
	КонецЕсли;
	
	//Параметры.Вставить("parse_mode", "HTML");
	Параметры.Вставить("photo"	, Файлы);
	
	Если Файлы.Количество() = 1 Тогда
		Ответ = ТГ_Апи.sendPhoto(Параметры);
	Иначе
		Ответ = ТГ_Апи.sendMediaGroup(Параметры);
	КонецЕсли;
	
	Если Файлы.Количество() = 1 Тогда
		НомерПоста = Ответ["result"]["message_id"];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Пост) И ТипЗнч(Пост) = Тип("ДокументСсылка.Пост") Тогда
		ОбъектПост = Пост.ПолучитьОбъект();
		ОбъектПост.ТГ_НомерПоста = НомерПоста;
		ОбъектПост.Записать();
	КонецЕсли;
	
	Возврат НомерПоста
	
КонецФункции

Функция ОтправитьСообщение(Идентификатор, Сообщение, Дополнение = "Страницы", ПользовательИБ) Экспорт
	
	Токен  		= Справочники.Сообщества.Athenaeum.TGB_token; 
	Апи  		= "api.telegram.org";
	
	МассивСимволов = Новый Соответствие;
	МассивСимволов.Вставить("<", "&lt;");
	МассивСимволов.Вставить(">", "&gt;");
	МассивСимволов.Вставить("&", "&amp;");
	МассивСимволов.Вставить("_", " ");
	МассивСимволов.Вставить("[", "(");
	МассивСимволов.Вставить("]", ")");
	
	Для Каждого СимволМассива Из МассивСимволов Цикл
		Сообщение = СтрЗаменить(Сообщение, СимволМассива.Ключ, СимволМассива.Значение);
	КонецЦикла;
	
	Ресурс 	= "bot"                                            
	+ Токен 
	+ "/sendMessage?chat_id=" 
	+ СтрЗаменить(Формат(Идентификатор, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") 
	+ "&text="
	+ СокрЛП(Сообщение);
	
	Если Дополнение = "Страницы" Тогда
		
		Строки = Новый Массив;
		Кнопки = Новый Массив;
		
		Кнопки.Добавить(Новый Структура("text,callback_data","<-"	,"<-"));
		Кнопки.Добавить(Новый Структура("text,callback_data","->"	,"->"));
		
		Строки.Добавить(Кнопки);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет,,,ЭкранированиеСимволовJSON.СимволыВнеASCII));
		ЗаписатьJSON(ЗаписьJSON, Новый Структура("keyboard,resize_keyboard",Строки, Истина));
		
		КлавВСообщ = ЗаписьJSON.Закрыть();
		
		Ресурс = Ресурс 
		+ "&parse_mode=Markdown"
		+ "&reply_markup=" + КлавВСообщ;
		
		
	ИначеЕсли Дополнение = "Скрыть" Тогда
		
		Ресурс = Ресурс
		+ "&parse_mode=Markdown"
		+ "&reply_markup={""hide_keyboard"":true}";
		
	КонецЕсли;
	
	Соединение  = Новый HTTPСоединение(Апи,443,,,,100,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос 		= Новый HTTPЗапрос(Ресурс);
	
	Ответ = Соединение.Получить(Запрос);  
	
	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ.ПолучитьТелоКакСтроку()
	,Перечисления.СоцСети.Telegram
	,Апи);
	
	РегистрыСведений.Диалоги.ЗаписатьСообщениеДиалога(
	Справочники.Пользователи.Ферапонт
	, ПользовательИБ
	, Перечисления.СоцСети.Telegram
	, Сообщение);
	
	Возврат Ответ.ПолучитьТелоКакСтроку();
	
КонецФункции

Функция ОтправитьСложнопост(Знач Сложнопост, Знач Сообщество) Экспорт
	
	Параметры = Новый Структура;
	Файлы = Новый Массив;
	
	Токен	= Сообщество.ТГ_token;
	Чат     = Сообщество.ТГ_chat_id;
	
	Для Каждого Ресурс Из Сложнопост.Ресурсы Цикл

		ИВФ = ПолучитьИмяВременногоФайла("png");
		
		СтруктураМедиа = Новый Структура;
		СтруктураМедиа.Вставить("МедиаДД", 	Ресурс.МедиаДД.Получить());
		СтруктураМедиа.Вставить("Медиа",	Ресурс.Медиа);
		СтруктураМедиа.Вставить("ТекстА",	Ресурс.ТекстА);
		СтруктураМедиа.Вставить("ТекстБ",	Ресурс.ТекстБ);
		СтруктураМедиа.Вставить("ТекстВ",	Ресурс.ТекстВ);
			
		Медиа = МетодыОбработкиИзображений.ОбработатьКартинкуПоШаблону(Ресурс.ВидОбработки, СтруктураМедиа);
	
		Файлы.Добавить(Медиа);
		
	КонецЦикла;

	
	Параметры.Вставить("token"	, Токен);
	Параметры.Вставить("chat_id", Чат);
	Параметры.Вставить("caption", Сложнопост.Текст);
	Параметры.Вставить("photo"	, Файлы);
	
	Ответ = ТГ_Апи.sendMediaGroup(Параметры);

	Возврат Ответ;
	
КонецФункции
#КонецОбласти
